# ApproximateLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Edge..::..ApproximateLength Property
Edge Class See Also
---
Returns the approximate length of the edge.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double ApproximateLength { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ApproximateLength As Double
	Get
```

Visual C++
---
```text
public:
property double ApproximateLength {
	double get ();
}
```

# Remarks
Estimates the length of the edge by adding together tessellated segments, Will underestimate when the surface is curved.
# See Also
Edge Class
Autodesk.Revit.DB Namespace